export const cardsContent = [
    {
        title: "ОПЫТ РАБОТЫ",
        list: [
            {
                hat: "3 МЕСЯЦА",
                text: "РАЗРАБОТКА ВНУТРЕННЕГО ИНСТРУМЕНТА ДЛЯ ОПЫТНОГО ЗАВОДА (FRONTEND, ЧАСТЬ BACKEND И РАЗВЁРТКА НА ХОСТИНГЕ)"
            },
            {
                hat: "3 МЕСЯЦА",
                text: "РАЗРАБОТКА FRONTEND ДЛЯ УМНЫХ СПОРТИВНЫХ ТАБЛО",
            },
            {
                hat: "1 ГОД",
                text: "РАЗРАБОТКА FRONTEND ДЛЯ СИСТЕМЫ КОНТРОЛЯ И УПРАВЛЕНИЯ ВОЗДУШНЫМИ ЛИНИЯМИ ЭЛЕКТРОПЕРЕДАЧ",
            }
        ]
    },
    {
        title: "ОБРАЗОВАНИЕ",
        text: "МЭИ ИВТИ (БЫВ. АВТИ, АВТФ) ГРУППА ЭТАЛОН"
    },
    {
        title: "ОСНОВНЫЕ РАБОЧИЕ НАВЫКИ",
        list: [
            {
                text: "REACT (TS, MANTINE, REACT-ROUTER-DOM, REACT-QUERY, ZUSTAND, TAILWIND, YMAPS) "
            },
            {
                text: "GIT",
            },
        ]
    },
    {
        title: "ВТОРИЧНЫЕ РАБОЧИЕ НАВЫКИ",
        list: [
            {
                text: "EXPRESS"
            },
            {
                text: "POSTGRESQL, SQLITE (С ИСПОЛЬЗОВАНИЕМ ORM И БЕЗ)",
            },
            {
                text: "LINUX"
            },
        ]
    },
    {
        title: "ЛИЧНЫЕ КАЧЕСТВА",
        text: "НАПРАВЛЕННО ВЫРАБОТАННАЯ И ОТТОЧЕННАЯ ГОДАМИ КОММУНИКАТИВНОСТЬ, СПОСОБНОСТЬ БЫСТРО ВЛИВАТЬСЯ В КОЛЛЕКТИВ, А ТАКЖЕ ЭФФЕКТИВНО В НЁМ РАБОТАТЬ. ИМЕЕТСЯ НЕОДНОКРАТНЫЙ ОПЫТ ОРГАНИЗАЦИИ РАБОЧЕГО ПРОЦЕССА И ДОСУГА КОЛЛЕКТИВА."
    },
]