import type { CardsContentType } from "../components/Card";

export type SectionsContentType = {
    [SectionName: string]: {
        title: string,
        cards: CardsContentType[],
    }
}


function getTimePassed(year: number, month: number): string {
    const now = new Date();
    const currentYear = now.getFullYear();
    const currentMonth = now.getMonth() + 2;
    
    let totalMonths = (currentYear - year) * 12 + (currentMonth - month);
    if (totalMonths < 0) totalMonths = 0;
    
    const years = Math.floor(totalMonths / 12);
    const months = totalMonths % 12;
    
    if (totalMonths === 0) return "меньше месяца";
    
    const yearsText = getDeclension(years, ['год', 'года', 'лет']);
    const monthsText = getDeclension(months, ['месяц', 'месяца', 'месяцев']);
    
    return [yearsText, monthsText].filter(Boolean).join(', ');
}

function getDeclension(number: number, forms: [string, string, string]): string {
    if (number === 0) return '';
    
    const n = Math.abs(number) % 100;
    const n1 = n % 10;
    
    if (n > 10 && n < 20) return `${number} ${forms[2]}`;
    if (n1 > 1 && n1 < 5) return `${number} ${forms[1]}`;
    if (n1 === 1) return `${number} ${forms[0]}`;
    
    return `${number} ${forms[2]}`;
}

export const SectionsContent: SectionsContentType = {
    "experience": {
        title: "ОПЫТ РАБОТЫ",
        cards: [
            {
                head: "ОПЫТНЫЙ ЗАВОД",
                title: "1 ГОД, 4 МЕСЯЦА",
                text: <div 
                    css={{
                        textAlign: "justify",
                        "& ul": {
                            marginTop: 0,
                            paddingLeft: "clamp(0.5rem, 2.5vw, 1rem)",
                        }
                    }}
                >
                    Участвовал в создании и развитии двух ключевых проектов, направленных на цифровизацию и автоматизацию процессов предприятия, а также на расширение его рыночных возможностей.
                    <ol>
                        <li>
                            Автоматизировал генерацию коммерческих предложений, разработав веб-платформу, генерирующую PDF на основе введенных в динамически генерируемую форму параметров:
                            <ul>
                                <li>Реализовал frontend на React, обеспечив современный, адаптивный и интуитивный интерфейс для сотрудников.</li>
                                <li>Разработал backend-модули на Express (Node.js) для обработки и хранения данных.</li>
                                <li>Настроил хостинг приложения, обеспечив стабильную работу и удобство обновлений.</li>
                            </ul>
                            Стек технологий: JavaScript, React, Fetch, CSS, Express (Node.JS)<br/>
                            Результаты:
                            <ul>
                                <li>Существенно сократил время подготовки коммерческих предложений.</li>
                                <li>Повысил точность и единообразие создаваемых КП за счёт стандартизации шаблонов.</li>
                                <li>Обеспечил надёжную интеграцию между frontend и backend через REST API.</li>
                            </ul>
                        </li>
                        <li>
                            Разработал frontend-часть комплексной системы "умных" спортивных табло, включающую три приложения:
                            <ul>
                                <li>Администраторское приложение - управление учётными записями, конструктор макетов табло.</li>
                                <li>Приложение для судей - управление матчами, командами и игроками, выбор макетов табло, загрузка медиафайлов.</li>
                                <li>Приложение для LED-табло - клиент, автоматически запускаемый на табло, обеспечивающий инициализацию устройства, а также вывод и автообновление отображаемой информации.</li>
                            </ul>
                            Разработка велась параллельно с проектированием и созданием аппаратной части, команда разработчиков участвовала в обсуждении архитектуры и логики взаимодействия между ПО и оборудованием.<br/>
                            Стек технологий: JavaScript, React, Fetch, CSS, Mantine<br/>
                            Результаты:
                            <ul>
                                <li>Создал надёжную экосистему из трёх взаимосвязанных приложений, автоматизировавшую управление соревнованиями и отображением информации.</li>
                                <li>Повысил эффективность работы персонала, сократив количество ручных операций.</li>
                                <li>Обеспечил стабильную работу интерфейсов с минимальной задержкой обновления данных.</li>
                                <li>Проект позволил заводу выйти на новый рынок, ранее не охваченный предприятием.</li>
                            </ul>
                        </li>
                    </ol>
                </div>
            },
            {
                head: "SERVICE ENERGY",
                title: getTimePassed(2024, 6).toUpperCase(),
                text: <div 
                    css={{
                        textAlign: "justify",
                        "& ul": {
                            marginTop: 0,
                            paddingLeft: "clamp(0.5rem, 2.5vw, 1rem)",
                        }
                    }}
                >
                    Разрабатываю веб-приложение для мониторинга состояния воздушных линий электропередач (на данный момент установлено уже свыше 10000 модулей дистанционной диагностики по всей России, а также в Казахстане, Кыргызстане, Грузии и Армении), предоставляемого клиентам по модели SaaS. Среди клиентов ПАО «Россети Центр и Приволжье», ПАО «Россети Московский регион», ООО «ЛУКОЙЛ-ЭНЕРГОСЕТИ». Веб-приложение отвечает за устойчивость критической инфраструктуры клиентов в области энергоснабжения.<br/>
                    На начальном этапе разработал масштабное обновление платформы, включавшего полный редизайн интерфейса, переработку UX-логики, частичное обновление архитектуры и расширение функциональности.<br/>
                    После внедрения глобального релиза участвую в feature-drop обновлениях:
                    <ul>
                        <li>Обновил Mantine с V5 на V8, что позволило уменьшить количество действий для совершения типовых сценариев.</li>
                        <li>Работаю в команде с другими разработчиками, взаимодействую с DevOps, Embedded и backend-специалистами.</li>
                    </ul>
                    Стек технологий: TypeScript, React, Mantine, Emotion CSS, TanStack (React Query), Zustand, TailwindCSS, Webpack, GIT, Yandex Maps API, Figma, ApexCharts, REST<br/>
                    Результаты:
                    <ul>
                        <li>Обновлённый интерфейс повысил удобство работы пользователей и ускорил выполнение типовых операций. Среднее количество кликов для типовых сценариев уменьшилось с 6 до 3. Удовлетворенность пользователей по опросам увеличилась на 0.34 балла по пятибальной шкале.</li>
                        <li>Платформа стала более стабильной и визуально современной, что способствовало росту числа клиентов и закупок оборудования.</li>
                        <li>Повысил качество кода за счёт внедрения современных архитектурных подходов.</li>
                    </ul>
                </div>,
            },
            {
                head: "ДАЛЬШЕ - БОЛЬШЕ",
            }
        ],
    },
    "education": {
        title: "ОБРАЗОВАНИЕ",
        cards: [
            {
                title: "БАКАЛАВРИАТ",
                text: 'ФГБОУ ВО "НИУ "МЭИ", ИВТИ (БЫВ. АВТИ, АВТФ), ГРУППА ЭТАЛОН'
            },
            {
                title: "СИСТЕМНЫЙ АНАЛИТИК",
                text: 'ФГБОУ ВО "НИУ "МЭИ", СИСТЕМЫ ИСКУССТВЕННОГО ИНТЕЛЛЕКТА В ЭНЕРГЕТИКЕ'
            },
            {
                title: "ОПЕРАТОР ЭВМ",
                text: "МАОУ ПКЛ, МАТЕМАТИКА И ИНФОРМАТИКА"
            },
        ],
    },
    "hardSkills": {
        title: "РАБОЧИЕ НАВЫКИ",
        cards: [
            {
                chips: [
                    { 
                        text: "Git",
                    },
                    { 
                        text: "CSS3",
                    },
                    { 
                        text: "React",
                    },
                    {
                        text: "JavaScript",
                    },
                    { 
                        text: "TypeScript",
                    },
                    { 
                        text: "HTML",
                    },
                    { 
                        text: "Linux",
                    },
                    { 
                        text: "Zustand",
                    },
                    { 
                        text: "Mantine",
                    },
                    { 
                        text: "Yandex Maps API",
                    },
                    { 
                        text: "Axios",
                    },
                    { 
                        text: "TanStack",
                    },
                    { 
                        text: "Tailwind",
                    },
                    { 
                        text: "PostgreSQL",
                    },
                    { 
                        text: "REST",
                    },
                    { 
                        text: "Figma",
                    },
                    { 
                        text: "CSS-in-JS",
                    },
                    { 
                        text: "Node.js",
                    },
                    { 
                        text: "Webpack",
                    },
                    { 
                        text: "Vite",
                    },
                    { 
                        text: "ApexCharts",
                    },
                    { 
                        text: "Yarn",
                    },
                    { 
                        text: "NPM",
                    },
                    { 
                        text: "Emotion CSS",
                    },
                    { 
                        text: "SASS/SCSS",
                    },
                    { 
                        text: "Modbus",
                    },
                    { 
                        text: "AI",
                    },
                ]
            },
        ]
    },
    "softSkills": {
        title: "ЛИЧНЫЕ КАЧЕСТВА",
        cards: [
            {
                list: [
                    {
                        text: "За время учёбы регулярно участвовал в хакатонах в качестве капитана, формируя команду и выстраивая процессы во время разработки. Во время наставничества в ШИН МЭИ адаптировал студентов, выстраивал атмосферу в учебных группах, выступал посредником между учащимися и руководством института."
                    }
                ]
            },
        ]
    }
}